SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_comp.c
/**
*\*\name    COMP_Reference_Voltage_Config.
*\*\fun     Configures the COMP reference voltage. 
*\*\param   Vv3Trim :
*\*\          - Value can be set from 0 to 63.
*\*\param   Vv3En :
*\*\          - false
*\*\          - true
*\*\param   Vv2Trim :
*\*\          - Value can be set from 0 to 63.
*\*\param   Vv2En :
*\*\          - false
*\*\          - true
*\*\param   Vv1Trim :
*\*\           - Value can be set from 0 to 63.     
*\*\param   Vv1En :
*\*\          - false
*\*\          - true
*\*\return  none
**/
void COMP_Voltage_Reference_Config(uint8_t vv3trim, bool vv3en, uint8_t vv2trim, bool vv2en, uint8_t vv1trim, bool vv1en)
{
    __IO uint32_t temp_value = 0;

    SetBitMsk(temp_value, vv3trim << REG_BIT15_OFFSET, COMP_VREFSCL_VV3TRM_MSK);
    SetBitMsk(temp_value, vv3en << REG_BIT14_OFFSET, COMP_VREFSCL_VV3EN_MSK);
    SetBitMsk(temp_value, vv2trim << REG_BIT8_OFFSET, COMP_VREFSCL_VV2TRM_MSK);
    SetBitMsk(temp_value, vv2en << REG_BIT7_OFFSET, COMP_VREFSCL_VV2EN_MSK);
    SetBitMsk(temp_value, vv1trim << REG_BIT1_OFFSET, COMP_VREFSCL_VV1TRM_MSK);
    SetBitMsk(temp_value, vv1en, COMP_VREFSCL_VV1EN_MSK);

    COMP->VREFSCL = temp_value;
}

/**
*\*\name    COMP_Window_Mode_Enable.
*\*\fun     Enable Comp Window Mode (input comparison of COMP1&2 by PA1).
*\*\return  none
**/
void COMP_Window_Mode_Enable(void)
{
    COMP->WINMODE = COMP_CMP12MD_ENABLE;
}

/**
*\*\name    COMP_Window_Mode_Disable.
*\*\fun     Disable Comp Window Mode (input comparison of COMP1&2 by PA1).
*\*\return  none
**/
void COMP_Window_Mode_Disable(void)
{
    COMP->WINMODE = COMP_CMP12MD_DISABLE;
}

/**
*\*\name    COMP2_Output_Xor_Enable.
*\*\fun     Enable the XOR output(comparison of COMP1&2).
*\*\return  none
**/
void COMP2_Output_Xor_Enable(void)
{
    COMP->CMP2OSEL = COMP_CMP2XO_ENABLE;
}

/**
*\*\name    COMP2_Output_Xor_Disable.
*\*\fun     Disable the XOR output(comparison of COMP1&2).
*\*\return  none
**/
void COMP2_Output_Xor_Disable(void)
{
    COMP->CMP2OSEL = COMP_CMP2XO_DISABLE;
}
/**
*\*\name    COMP_Output_Status_Get.
*\*\fun     Get COMPx Output Status.
*\*\param   COMPx :
*\*\          - COMP1
*\*\          - COMP2
*\*\          - COMP3
*\*\return  FlagStatus:
*\*\          - SET
*\*\          - RESET
**/
FlagStatus COMP_Output_Status_Get(COMPX COMPx)
{
    if(COMPx == COMP1)
    {
        return (COMP->Cmp1.CTRL & COMP_OUT_MASK) ? SET : RESET;
    }
    else if(COMPx == COMP2)
    {
        return (COMP->Cmp2.CTRL & COMP_OUT_MASK) ? SET : RESET;
    }
    else
    {
        return (COMP->Cmp3.CTRL & COMP_OUT_MASK) ? SET : RESET;
    }
}
/**
*\*\name    COMP_Interrupt_Status_OneComp_Get.
*\*\fun     Get COMPx Output Status.
*\*\param   COMPx :
*\*\          - COMP1
*\*\          - COMP2
*\*\          - COMP3
*\*\return  FlagStatus:
*\*\          - SET
*\*\          - RESET
**/
FlagStatus COMP_Interrupt_Status_OneComp_Get(COMPX COMPx)
{
    return (COMP->INTSTS & (REG_BIT1_OFFSET << COMPx)) ? SET : RESET;
}
/**
*\*\name    COMP_Interrupt_Status_OneComp_Clear.
*\*\fun     Clear COMPx Output Status.
*\*\param   COMPx :
*\*\          - COMP1
*\*\          - COMP2
*\*\          - COMP3
*\*\return  none
**/
void COMP_Interrupt_Status_OneComp_Clear(COMPX COMPx)
{
	  COMP->INTSTS &= ((~(REG_BIT1_OFFSET << COMPx )));
}


/**
*\*\name    COMP_Filter_Control_Config.
*\*\fun     Configures the COMP filter control value.
*\*\param   COMPx :
*\*\          - COMP1
*\*\          - COMP2
*\*\          - COMP3
*\*\param   sw :
*\*\          - ENABLE
*\*\          - DISABLE
*\*\param   threshnum :
*\*\          - Threshold Value need > SampWindow/2.      
*\*\param   sampwindow :
*\*\          -  Value can be set from 0 to 31.
*\*\return  none
**/
void COMP_Filter_Control_Config(COMPX COMPx , uint32_t sw, uint8_t threshold , uint8_t sampwindow)
{
    COMP_Filter_SampWindow_Config(COMPx, sampwindow);
    COMP_Filter_Threshold_Config(COMPx, threshold);
    if(sw == ENABLE)
    {
        COMP_Filter_Enable(COMPx);
    }
    else
    {
        COMP_Filter_Disable(COMPx);
    }
}

/**
*\*\name    COMP_Initializes.
*\*\fun     Initializes the COMPx according to COMP_initstruct.
*\*\param   COMPx :
*\*\          - COMP1
*\*\          - COMP2
*\*\          - COMP3
*\*\param   COMP_initstruct :
*\*\          - Blking
*\*\            - COMP_BLANKING_NO
*\*\            - COMP_BLANKING_TIM1_OC5
*\*\            - COMP_BLANKING_TIM8_OC5
*\*\          - Hyst
*\*\            - COMP_HYST_NO   
*\*\            - COMP_HYST_LOW    
*\*\            - COMP_HYST_MID    
*\*\            - COMP_HYST_HIGH   
*\*\          - PolRev
*\*\            - COMP_OUTPOL_FLIP             
*\*\            - COMP_OUTPOL_NFLIP              
*\*\          - OutSel  
*\*\             comp1 out trig 
*\*\            - COMP1_OUTSEL_TIM1_BKIN             
*\*\            - COMP1_OUTSEL_TIM1_OCREFCLEAR       
*\*\            - COMP1_OUTSEL_TIM1_IC1              
*\*\            - COMP1_OUTSEL_TIM2_IC1              
*\*\            - COMP1_OUTSEL_TIM2_OCREFCLEAR       
*\*\            - COMP1_OUTSEL_TIM3_IC1              
*\*\            - COMP1_OUTSEL_TIM3_OCREFCLEAR       
*\*\            - COMP1_OUTSEL_TIM4_OCREFCLEAR       
*\*\            - COMP1_OUTSEL_TIM5_IC1              
*\*\            - COMP1_OUTSEL_TIM8_IC1              
*\*\            - COMP1_OUTSEL_TIM8_OCREFCLEAR       
*\*\            - COMP1_OUTSEL_TIM8_BKIN             
*\*\            - COMP1_OUTSEL_TIM1_BKIN_TIM8_BKIN   
*\*\            - COMP1_OUTSEL_LPTIM_ETR                 
*\*\             comp2 out trig 
*\*\            - COMP2_OUTSEL_TIM1_BKIN             
*\*\            - COMP2_OUTSEL_TIM1_OCREFCLEAR       
*\*\            - COMP2_OUTSEL_TIM1_IC1              
*\*\            - COMP2_OUTSEL_TIM2_OCREFCLEAR       
*\*\            - COMP2_OUTSEL_TIM3_OCREFCLEAR       
*\*\            - COMP2_OUTSEL_TIM4_IC1              
*\*\            - COMP2_OUTSEL_TIM4_OCREFCLEAR       
*\*\            - COMP2_OUTSEL_TIM5_IC1              
*\*\            - COMP2_OUTSEL_TIM8_IC1              
*\*\            - COMP2_OUTSEL_TIM8_OCREFCLEAR       
*\*\            - COMP2_OUTSEL_TIM8_BKIN             
*\*\            - COMP2_OUTSEL_TIM1_BKIN_TIM8_BKIN   
*\*\            - COMP2_OUTSEL_LPTIM_ETR             
*\*\             comp3 out trig 
*\*\            - COMP3_OUTSEL_TIM1_BKIN             
*\*\            - COMP3_OUTSEL_TIM1_OCREFCLEAR       
*\*\            - COMP3_OUTSEL_TIM1_IC1              
*\*\            - COMP3_OUTSEL_TIM2_IC1              
*\*\            - COMP3_OUTSEL_TIM5_OCREFCLEAR       
*\*\            - COMP3_OUTSEL_TIM3_IC1              
*\*\            - COMP3_OUTSEL_TIM3_OCREFCLEAR       
*\*\            - COMP3_OUTSEL_TIM4_OCREFCLEAR       
*\*\            - COMP3_OUTSEL_TIM5_IC1              
*\*\            - COMP3_OUTSEL_TIM8_IC1              
*\*\            - COMP3_OUTSEL_TIM8_OCREFCLEAR       
*\*\            - COMP3_OUTSEL_TIM8_BKIN             
*\*\            - COMP3_OUTSEL_TIM1_BKIN_TIM8_BKIN   
*\*\            - COMP3_OUTSEL_LPTIM_ETR              
*\*\          - InpSel                
*\*\             comp1 inp sel 
*\*\            - COMP1_INPSEL_PA0                   
*\*\            - COMP1_INPSEL_PA2                   
*\*\            - COMP1_INPSEL_PA12                  
*\*\            - COMP1_INPSEL_PB3                   
*\*\            - COMP1_INPSEL_PB4                   
*\*\            - COMP1_INPSEL_PB10                  
*\*\            - COMP1_INPSEL_PA1                   
*\*\            - COMP1_INPSEL_FLOAT              
*\*\             comp2 inp sel 
*\*\            - COMP2_INPSEL_PA1                   
*\*\            - COMP2_INPSEL_PA3                  
*\*\            - COMP2_INPSEL_PA6                  
*\*\            - COMP2_INPSEL_PA7                  
*\*\            - COMP2_INPSEL_PA11                
*\*\            - COMP2_INPSEL_PA15                
*\*\            - COMP2_INPSEL_PB7                 
*\*\            - COMP2_INPSEL_FLOAT                               
*\*\             comp3 inp sel 
*\*\            - COMP3_INPSEL_PA0               
*\*\            - COMP3_INPSEL_PB1                   
*\*\            - COMP3_INPSEL_PB11                  
*\*\            - COMP3_INPSEL_PB15                  
*\*\            - COMP3_INPSEL_PB3                   
*\*\            - COMP3_INPSEL_PB5                   
*\*\            - COMP3_INPSEL_FLOAT                 
*\*\            - COMP3_INPSEL_FLOAT                                        
*\*\          - InmSel
*\*\             comp1 inm sel 
*\*\            - COMP1_INMSEL_VREF_VC1              
*\*\            - COMP1_INMSEL_PA4                   
*\*\            - COMP1_INMSEL_PA0                   
*\*\            - COMP1_INMSEL_PA5                   
*\*\            - COMP1_INMSEL_PB5                   
*\*\            - COMP1_INMSEL_FLOAT                 
*\*\            - COMP1_INMSEL_FLOAT                 
*\*\            - COMP1_INMSEL_FLOAT                            
*\*\             comp2 inm sel 
*\*\            - COMP2_INMSEL_VERF_VC2              
*\*\            - COMP2_INMSEL_PA2                   
*\*\            - COMP2_INMSEL_PA5                   
*\*\            - COMP2_INMSEL_PA6                   
*\*\            - COMP2_INMSEL_PB3                   
*\*\            - COMP2_INMSEL_PA4                   
*\*\            - COMP2_INMSEL_FLOAT                 
*\*\            - COMP2_INMSEL_FLOAT                          
*\*\             comp3 inm sel 
*\*\            - COMP3_INMSEL_VREF_VC3           
*\*\            - COMP3_INMSEL_PA3                 
*\*\            - COMP3_INMSEL_PB0                  
*\*\            - COMP3_INMSEL_PB2                
*\*\            - COMP3_INMSEL_PB14               
*\*\            - COMP3_INMSEL_FLOAT               
*\*\            - COMP3_INMSEL_FLOAT                
*\*\            - COMP3_INMSEL_FLOAT                             
*\*\          - En
*\*\            - ENABLE
*\*\            - DISABLE
*\*\          - SampWindow
*\*\            - SampWindow Value ranges from 0~31. 
*\*\          - Threshold
*\*\            - Threshold Value need > SampWindow/2.
*\*\          - FilterEn
*\*\            - ENABLE
*\*\            - DISABLE
*\*\          - ClkPsc
*\*\            - ClkPsc Value ranges from 0~32767. 
*\*\return  none
**/
void COMP_Initializes(COMPX COMPx, COMP_InitType* COMP_initstruct)
{
    /** filter configures **/
    COMP_Filter_SampWindow_Config(COMPx, COMP_initstruct->SampWindow);
    COMP_Filter_Threshold_Config(COMPx, COMP_initstruct->Threshold);
    if(COMP_initstruct->FilterEn == ENABLE)
    {
        COMP_Filter_Enable(COMPx);
    }   
    else
    {
        COMP_Filter_Disable(COMPx);
    }
    /** filter clock Prescale configures **/
    COMP_Filter_Clock_Prescale_Config(COMPx, COMP_initstruct->ClkPsc);
    
    /** ctrl configures**/
    COMP_Blking_Soucre_Config(COMPx, COMP_initstruct->Blking);
    COMP_Hysteresis_Level_Config(COMPx, COMP_initstruct->Hyst);
    COMP_Output_Polarity_Config(COMPx, COMP_initstruct->PolRev);
    COMP_InpSel_Config(COMPx, COMP_initstruct->InpSel);
    COMP_InmSel_Config(COMPx, COMP_initstruct->InmSel);
    COMP_Output_Trigger_Config(COMPx, COMP_initstruct->OutSel);

    /** comp enable or disable configures*/
    if (COMP_initstruct->En == ENABLE)
        COMP_ON(COMPx);
    else
        COMP_OFF(COMPx);
}

